test/data.html

<?xml version="1.0" encoding="utf-8"?><?xml-stylesheet type="text/xsl" href="style/style.xsl"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><HCandMetadata xmlns="http://opendap.co-ops.nos.noaa.gov/axis/webservices/harmonicconstituents/wsdl"><stationId>8454000</stationId><stationName>Providence</stationName><latitude>41.8072</latitude><longitude>-71.4011</longitude><state>RI</state><dataSource>USDOC/NOAA/NOS/COOPS(Center for Operational Oceanographic Products and Services)</dataSource><timeZone>GMT</timeZone><unit>Amplitudes are in Meters, Phases are in degrees, referenced to GMT, and Speed in degrees per hour</unit><data><item><constNum>1</constNum><name>M2</name><amplitude>0.643</amplitude><phase>9.5</phase><speed>28.984104</speed></item><item><constNum>2</constNum><name>S2</name><amplitude>0.138</amplitude><phase>33.6</phase><speed>30.0</speed></item><item><constNum>3</constNum><name>N2</name><amplitude>0.152</amplitude><phase>354.6</phase><speed>28.43973</speed></item><item><constNum>4</constNum><name>K1</name><amplitude>0.073</amplitude><phase>169.4</phase><speed>15.041069</speed></item><item><constNum>5</constNum><name>M4</name><amplitude>0.103</amplitude><phase>62.1</phase><speed>57.96821</speed></item><item><constNum>6</constNum><name>O1</name><amplitude>0.056</amplitude><phase>202.2</phase><speed>13.943035</speed></item><item><constNum>7</constNum><name>M6</name><amplitude>0.027</amplitude><phase>312.7</phase><speed>86.95232</speed></item><item><constNum>8</constNum><name>MK3</name><amplitude>0.016</amplitude><phase>39.3</phase><speed>44.025173</speed></item><item><constNum>9</constNum><name>S4</name><amplitude>0.014</amplitude><phase>23.8</phase><speed>60.0</speed></item><item><constNum>10</constNum><name>MN4</name><amplitude>0.044</amplitude><phase>12.7</phase><speed>57.423832</speed></item><item><constNum>11</constNum><name>NU2</name><amplitude>0.027</amplitude><phase>353.0</phase><speed>28.512583</speed></item><item><constNum>12</constNum><name>S6</name><amplitude>0.0</amplitude><phase>0.0</phase><speed>90.0</speed></item><item><constNum>13</constNum><name>MU2</name><amplitude>0.031</amplitude><phase>358.6</phase><speed>27.968208</speed></item><item><constNum>14</constNum><name>2N2</name><amplitude>0.022</amplitude><phase>343.2</phase><speed>27.895355</speed></item><item><constNum>15</constNum><name>OO1</name><amplitude>0.002</amplitude><phase>136.5</phase><speed>16.139101</speed></item><item><constNum>16</constNum><name>LAM2</name><amplitude>0.005</amplitude><phase>346.1</phase><speed>29.455626</speed></item><item><constNum>17</constNum><name>S1</name><amplitude>0.016</amplitude><phase>125.0</phase><speed>15.0</speed></item><item><constNum>18</constNum><name>M1</name><amplitude>0.005</amplitude><phase>247.6</phase><speed>14.496694</speed></item><item><constNum>19</constNum><name>J1</name><amplitude>0.006</amplitude><phase>197.1</phase><speed>15.5854435</speed></item><item><constNum>20</constNum><name>MM</name><amplitude>0.0</amplitude><phase>0.0</phase><speed>0.5443747</speed></item><item><constNum>21</constNum><name>SSA</name><amplitude>0.0</amplitude><phase>0.0</phase><speed>0.0821373</speed></item><item><constNum>22</constNum><name>SA</name><amplitude>0.06</amplitude><phase>131.8</phase><speed>0.0410686</speed></item><item><constNum>23</constNum><name>MSF</name><amplitude>0.0</amplitude><phase>0.0</phase><speed>1.0158958</speed></item><item><constNum>24</constNum><name>MF</name><amplitude>0.0</amplitude><phase>0.0</phase><speed>1.0980331</speed></item><item><constNum>25</constNum><name>RHO</name><amplitude>0.002</amplitude><phase>216.2</phase><speed>13.471515</speed></item><item><constNum>26</constNum><name>Q1</name><amplitude>0.016</amplitude><phase>179.9</phase><speed>13.398661</speed></item><item><constNum>27</constNum><name>T2</name><amplitude>0.013</amplitude><phase>14.1</phase><speed>29.958933</speed></item><item><constNum>28</constNum><name>R2</name><amplitude>0.004</amplitude><phase>216.5</phase><speed>30.041067</speed></item><item><constNum>29</constNum><name>2Q1</name><amplitude>0.001</amplitude><phase>234.6</phase><speed>12.854286</speed></item><item><constNum>30</constNum><name>P1</name><amplitude>0.025</amplitude><phase>182.3</phase><speed>14.958931</speed></item><item><constNum>31</constNum><name>2SM2</name><amplitude>0.0</amplitude><phase>0.0</phase><speed>31.015896</speed></item><item><constNum>32</constNum><name>M3</name><amplitude>0.012</amplitude><phase>68.3</phase><speed>43.47616</speed></item><item><constNum>33</constNum><name>L2</name><amplitude>0.012</amplitude><phase>321.4</phase><speed>29.528479</speed></item><item><constNum>34</constNum><name>2MK3</name><amplitude>0.012</amplitude><phase>11.5</phase><speed>42.92714</speed></item><item><constNum>35</constNum><name>K2</name><amplitude>0.038</amplitude><phase>29.7</phase><speed>30.082138</speed></item><item><constNum>36</constNum><name>M8</name><amplitude>0.005</amplitude><phase>130.7</phase><speed>115.93642</speed></item><item><constNum>37</constNum><name>MS4</name><amplitude>0.026</amplitude><phase>147.4</phase><speed>58.984104</speed></item></data></HCandMetadata></soapenv:Body></soapenv:Envelope>







